[Killed] BlockStatement
src/utils/validateModel.ts:26:30
 }
 
 /** Быстрая нормализация типа для сравнения совместимости (INT == int ==  Int ) */
-function normType(t: string) {
-  return (t || "").replace(/\s+/g, "").toUpperCase();
-}
+function normType(t: string) {}
 
 /** Набор имён сущностей → для быстрых проверок */
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 19ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 2 failed) 228ms

[Killed] LogicalOperator
src/utils/validateModel.ts:27:11
 
 /** Быстрая нормализация типа для сравнения совместимости (INT == int ==  Int ) */
 function normType(t: string) {
-  return (t || "").replace(/\s+/g, "").toUpperCase();
+  return (t && "").replace(/\s+/g, "").toUpperCase();
 }
 
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 37ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 2 failed) 133ms

[Survived] MethodExpression
src/utils/validateModel.ts:27:10
 
 /** Быстрая нормализация типа для сравнения совместимости (INT == int ==  Int ) */
 function normType(t: string) {
-  return (t || "").replace(/\s+/g, "").toUpperCase();
+  return (t || "").replace(/\s+/g, "").toLowerCase();
 }
 

[Killed] BlockStatement
src/utils/validateModel.ts:33:29
 /** Набор имён сущностей → для быстрых проверок */
 function buildNameMap(entities: Entity[]) {
   const byLower = new Map<string, Entity[]>();
-  for (const e of entities) {
-    const key = sanitize(e.name).toLowerCase();
-    const list = byLower.get(key) ?? [];
-    list.push(e);
-    byLower.set(key, list);
-  }
+  for (const e of entities) {}
   return byLower;
 }
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh


 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 10ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 2 failed) 143ms

     × негатив: повтор User/user → DUP_ENTITY_NAME 49ms

[Survived] MethodExpression
src/utils/validateModel.ts:34:17
 function buildNameMap(entities: Entity[]) {
   const byLower = new Map<string, Entity[]>();
   for (const e of entities) {
-    const key = sanitize(e.name).toLowerCase();
+    const key = sanitize(e.name).toUpperCase();
     const list = byLower.get(key) ?? [];
     list.push(e);

[Survived] BlockStatement
src/utils/validateModel.ts:43:76
 }
 
 /** Похоже ли имя таблицы на «линк-таблицу» двух сущностей (по включению обоих корней в snake_case) */
-function looksLikeLinkName(linkName: string, aName: string, bName: string) {
-  const en = snake(linkName);
-  const an = snake(toSingular(sanitize(aName)));
-  const bn = snake(toSingular(sanitize(bName)));
-  return en.includes(an) && en.includes(bn);
-}
+function looksLikeLinkName(linkName: string, aName: string, bName: string) {}
 
 /** Вспомогательные для новых проверок */

[Survived] LogicalOperator
src/utils/validateModel.ts:47:10
   const en = snake(linkName);
   const an = snake(toSingular(sanitize(aName)));
   const bn = snake(toSingular(sanitize(bName)));
-  return en.includes(an) && en.includes(bn);
+  return en.includes(an) || en.includes(bn);
 }
 

[Survived] ConditionalExpression
src/utils/validateModel.ts:47:10
   const en = snake(linkName);
   const an = snake(toSingular(sanitize(aName)));
   const bn = snake(toSingular(sanitize(bName)));
-  return en.includes(an) && en.includes(bn);
+  return false;
 }
 

[Killed] MethodExpression
src/utils/validateModel.ts:52:10
 
 /** Вспомогательные для новых проверок */
 function hasSelfRelation(entityId: string, relationships: Relationship[]) {
-  return relationships.some(r =>
-    (r.type === "one-to-many" || r.type === "one-to-one") &&
-    r.from === entityId && r.to === entityId
-  );
+  return relationships.every(r => (r.type === "one-to-many" || r.type === "one-to-one") && r.from === entityId && r.to === entityId);
 }
 function countIdCols(e: Entity) {
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 10ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 124ms

[Survived] ArrowFunction
src/utils/validateModel.ts:52:29
 
 /** Вспомогательные для новых проверок */
 function hasSelfRelation(entityId: string, relationships: Relationship[]) {
-  return relationships.some(r =>
-    (r.type === "one-to-many" || r.type === "one-to-one") &&
-    r.from === entityId && r.to === entityId
+  return relationships.some(() => undefined
   );
 }

[Survived] LogicalOperator
src/utils/validateModel.ts:53:5
 /** Вспомогательные для новых проверок */
 function hasSelfRelation(entityId: string, relationships: Relationship[]) {
   return relationships.some(r =>
-    (r.type === "one-to-many" || r.type === "one-to-one") &&
-    r.from === entityId && r.to === entityId
+    (r.type === "one-to-many" || r.type === "one-to-one") && r.from === entityId || r.to === entityId
   );
 }

[Survived] ConditionalExpression
src/utils/validateModel.ts:53:6
 /** Вспомогательные для новых проверок */
 function hasSelfRelation(entityId: string, relationships: Relationship[]) {
   return relationships.some(r =>
-    (r.type === "one-to-many" || r.type === "one-to-one") &&
+    (true) &&
     r.from === entityId && r.to === entityId
   );

[Survived] ConditionalExpression
src/utils/validateModel.ts:54:5
 function hasSelfRelation(entityId: string, relationships: Relationship[]) {
   return relationships.some(r =>
     (r.type === "one-to-many" || r.type === "one-to-one") &&
-    r.from === entityId && r.to === entityId
+    true && r.to === entityId
   );
 }

[Survived] ConditionalExpression
src/utils/validateModel.ts:54:28
 function hasSelfRelation(entityId: string, relationships: Relationship[]) {
   return relationships.some(r =>
     (r.type === "one-to-many" || r.type === "one-to-one") &&
-    r.from === entityId && r.to === entityId
+    r.from === entityId && true
   );
 }

[Killed] ArrowFunction
src/utils/validateModel.ts:58:30
   );
 }
 function countIdCols(e: Entity) {
-  return e.attributes.filter(a => /_id$/i.test(sanitize(a.name))).map(a => sanitize(a.name));
+  return e.attributes.filter(() => undefined).map(a => sanitize(a.name));
 }
 function findEntityByRootName(entities: Entity[], rootSnake: string): Entity | null {
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 8ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 179ms
     ✓ негатив: повтор User/user → DUP_ENTITY_NAME 16ms

[Survived] MethodExpression
src/utils/validateModel.ts:58:10
   );
 }
 function countIdCols(e: Entity) {
-  return e.attributes.filter(a => /_id$/i.test(sanitize(a.name))).map(a => sanitize(a.name));
+  return e.attributes.map(a => sanitize(a.name));
 }
 function findEntityByRootName(entities: Entity[], rootSnake: string): Entity | null {

[Killed] MethodExpression
src/utils/validateModel.ts:61:18
   return e.attributes.filter(a => /_id$/i.test(sanitize(a.name))).map(a => sanitize(a.name));
 }
 function findEntityByRootName(entities: Entity[], rootSnake: string): Entity | null {
-  const wanted = rootSnake.toLowerCase();
+  const wanted = rootSnake.toUpperCase();
   return entities.find(en => snake(en.name) === wanted) || null;
 }
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 15ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 145ms

[Killed] ConditionalExpression
src/utils/validateModel.ts:62:30
 }
 function findEntityByRootName(entities: Entity[], rootSnake: string): Entity | null {
   const wanted = rootSnake.toLowerCase();
-  return entities.find(en => snake(en.name) === wanted) || null;
+  return entities.find(en => true) || null;
 }
 
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 7ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 109ms

[Killed] ArrowFunction
src/utils/validateModel.ts:62:24
 }
 function findEntityByRootName(entities: Entity[], rootSnake: string): Entity | null {
   const wanted = rootSnake.toLowerCase();
-  return entities.find(en => snake(en.name) === wanted) || null;
+  return entities.find(() => undefined) || null;
 }
 
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 10ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 175ms

[Killed] Regex
src/utils/validateModel.ts:66:18
 }
 
 /** Базовые правила валидных идентификаторов без кавычек */
-const IDENT_OK = /^[A-Za-z_][A-Za-z0-9_]*$/;
+const IDENT_OK = /^[A-Za-z_][^A-Za-z0-9_]*$/;
 
 /** Короткий список зарезервированных слов (пересечение Postgres/MySQL + частые коллизии имён) */
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 13ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 5 failed) 104ms

[Killed] Regex
src/utils/validateModel.ts:66:18
 }
 
 /** Базовые правила валидных идентификаторов без кавычек */
-const IDENT_OK = /^[A-Za-z_][A-Za-z0-9_]*$/;
+const IDENT_OK = /[A-Za-z_][A-Za-z0-9_]*$/;
 
 /** Короткий список зарезервированных слов (пересечение Postgres/MySQL + частые коллизии имён) */
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 15ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 2 failed) 92ms

[Survived] StringLiteral
src/utils/validateModel.ts:70:12
 
 /** Короткий список зарезервированных слов (пересечение Postgres/MySQL + частые коллизии имён) */
 const RESERVED = new Set([
-  "select","insert","update","delete","table","column","index",
+  "select","","update","delete","table","column","index",
   "primary","foreign","key","unique","constraint","references","check","where","from","to",
   "limit","offset","join","left","right","inner","outer","full","and","or","not","as",

[Survived] StringLiteral
src/utils/validateModel.ts:71:51
 /** Короткий список зарезервированных слов (пересечение Postgres/MySQL + частые коллизии имён) */
 const RESERVED = new Set([
   "select","insert","update","delete","table","column","index",
-  "primary","foreign","key","unique","constraint","references","check","where","from","to",
+  "primary","foreign","key","unique","constraint","","check","where","from","to",
   "limit","offset","join","left","right","inner","outer","full","and","or","not","as",
   "values","default"

[Survived] StringLiteral
src/utils/validateModel.ts:72:71
 const RESERVED = new Set([
   "select","insert","update","delete","table","column","index",
   "primary","foreign","key","unique","constraint","references","check","where","from","to",
-  "limit","offset","join","left","right","inner","outer","full","and","or","not","as",
+  "limit","offset","join","left","right","inner","outer","full","and","","not","as",
   "values","default"
 ]);

[Survived] StringLiteral
src/utils/validateModel.ts:72:50
 const RESERVED = new Set([
   "select","insert","update","delete","table","column","index",
   "primary","foreign","key","unique","constraint","references","check","where","from","to",
-  "limit","offset","join","left","right","inner","outer","full","and","or","not","as",
+  "limit","offset","join","left","right","inner","","full","and","or","not","as",
   "values","default"
 ]);

[Killed] BlockStatement
src/utils/validateModel.ts:84:34
 
   // Быстрые счётчики связей по сущности
   const relCountByEntity = new Map<string, number>();
-  for (const r of relationships) {
-    relCountByEntity.set(r.from, (relCountByEntity.get(r.from) ?? 0) + 1);
-    relCountByEntity.set(r.to,   (relCountByEntity.get(r.to)   ?? 0) + 1);
-  }
+  for (const r of relationships) {}
   const hasAnyRelations = (entityId: string) => (relCountByEntity.get(entityId) ?? 0) > 0;
 
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 6ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 114ms

[Survived] ArithmeticOperator
src/utils/validateModel.ts:85:34
   // Быстрые счётчики связей по сущности
   const relCountByEntity = new Map<string, number>();
   for (const r of relationships) {
-    relCountByEntity.set(r.from, (relCountByEntity.get(r.from) ?? 0) + 1);
+    relCountByEntity.set(r.from, (relCountByEntity.get(r.from) ?? 0) - 1);
     relCountByEntity.set(r.to,   (relCountByEntity.get(r.to)   ?? 0) + 1);
   }

[Killed] ArithmeticOperator
src/utils/validateModel.ts:86:34
   const relCountByEntity = new Map<string, number>();
   for (const r of relationships) {
     relCountByEntity.set(r.from, (relCountByEntity.get(r.from) ?? 0) + 1);
-    relCountByEntity.set(r.to,   (relCountByEntity.get(r.to)   ?? 0) + 1);
+    relCountByEntity.set(r.to,   (relCountByEntity.get(r.to) ?? 0) - 1);
   }
   const hasAnyRelations = (entityId: string) => (relCountByEntity.get(entityId) ?? 0) > 0;
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 5ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 127ms

[Killed] EqualityOperator
src/utils/validateModel.ts:88:49
     relCountByEntity.set(r.from, (relCountByEntity.get(r.from) ?? 0) + 1);
     relCountByEntity.set(r.to,   (relCountByEntity.get(r.to)   ?? 0) + 1);
   }
-  const hasAnyRelations = (entityId: string) => (relCountByEntity.get(entityId) ?? 0) > 0;
+  const hasAnyRelations = (entityId: string) => (relCountByEntity.get(entityId) ?? 0) <= 0;
 
   // --- 1) Дубликаты имён сущностей (без учёта регистра) ---
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh


 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 6ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 5 failed) 148ms

     ✓ негатив: повтор User/user → DUP_ENTITY_NAME 11ms

[Killed] EqualityOperator
src/utils/validateModel.ts:88:49
     relCountByEntity.set(r.from, (relCountByEntity.get(r.from) ?? 0) + 1);
     relCountByEntity.set(r.to,   (relCountByEntity.get(r.to)   ?? 0) + 1);
   }
-  const hasAnyRelations = (entityId: string) => (relCountByEntity.get(entityId) ?? 0) > 0;
+  const hasAnyRelations = (entityId: string) => (relCountByEntity.get(entityId) ?? 0) >= 0;
 
   // --- 1) Дубликаты имён сущностей (без учёта регистра) ---
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 6ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 4 failed) 90ms

[Killed] BlockStatement
src/utils/validateModel.ts:91:35
   const hasAnyRelations = (entityId: string) => (relCountByEntity.get(entityId) ?? 0) > 0;
 
   // --- 1) Дубликаты имён сущностей (без учёта регистра) ---
-  for (const [, list] of nameMap) {
-    if (list.length > 1) {
-      issues.push({
-        level: "error",
-        code: "DUP_ENTITY_NAME",
-        message: `Имя сущности «${list[0].name}» используется для нескольких таблиц (${list.length}).`,
-        where: list.map(e => e.id),
-        suggestion: "Переименуйте сущности так, чтобы имена были уникальны.",
-      });
-    }
-  }
+  for (const [, list] of nameMap) {}
 
   // --- 1a) Резерв/кавычки для имён сущностей ---
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 10ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 2 failed) 101ms

[Killed] ConditionalExpression
src/utils/validateModel.ts:92:9
 
   // --- 1) Дубликаты имён сущностей (без учёта регистра) ---
   for (const [, list] of nameMap) {
-    if (list.length > 1) {
+    if (true) {
       issues.push({
         level: "error",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh


 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 6ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 27 failed) 214ms

     ✓ негатив: повтор User/user → DUP_ENTITY_NAME 26ms

[Killed] ConditionalExpression
src/utils/validateModel.ts:92:9
 
   // --- 1) Дубликаты имён сущностей (без учёта регистра) ---
   for (const [, list] of nameMap) {
-    if (list.length > 1) {
+    if (false) {
       issues.push({
         level: "error",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 14ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 2 failed) 100ms

[Killed] BlockStatement
src/utils/validateModel.ts:104:29
   }
 
   // --- 1a) Резерв/кавычки для имён сущностей ---
-  for (const e of entities) {
-    const raw = e.name;
-    const norm = sanitize(raw);
-    if (!IDENT_OK.test(norm)) {
-      issues.push({
-        level: "warning",
-        code: "IDENT_NEEDS_QUOTING_ENTITY",
-        message: `Имя таблицы «${raw}» требует экранирования (кавычек) в SQL.`,
-        where: [e.id],
-        suggestion: "Переименуйте таблицу в буквенно-цифровое имя с подчёркиванием, чтобы избежать кавычек."
-      });
-    } else if (RESERVED.has(norm.toLowerCase())) {
-      issues.push({
-        level: "warning",
-        code: "RESERVED_WORD_ENTITY",
-        message: `Имя таблицы «${raw}» совпадает с зарезервированным словом SQL.`,
-        where: [e.id],
-        suggestion: "Переименуйте таблицу или оставьте как есть (генератор процитирует имя)."
-      });
-    }
-  }
+  for (const e of entities) {}
 
   // --- 2) Повторяющиеся атрибуты в одной сущности ---
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 6ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 2 failed) 104ms

[Killed] BlockStatement
src/utils/validateModel.ts:107:31
   for (const e of entities) {
     const raw = e.name;
     const norm = sanitize(raw);
-    if (!IDENT_OK.test(norm)) {
-      issues.push({
-        level: "warning",
-        code: "IDENT_NEEDS_QUOTING_ENTITY",
-        message: `Имя таблицы «${raw}» требует экранирования (кавычек) в SQL.`,
-        where: [e.id],
-        suggestion: "Переименуйте таблицу в буквенно-цифровое имя с подчёркиванием, чтобы избежать кавычек."
-      });
-    } else if (RESERVED.has(norm.toLowerCase())) {
+    if (!IDENT_OK.test(norm)) {} else if (RESERVED.has(norm.toLowerCase())) {
       issues.push({
         level: "warning",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 20ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 92ms

[Killed] ConditionalExpression
src/utils/validateModel.ts:107:9
   for (const e of entities) {
     const raw = e.name;
     const norm = sanitize(raw);
-    if (!IDENT_OK.test(norm)) {
+    if (true) {
       issues.push({
         level: "warning",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 8ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 3 failed) 114ms

[Survived] ArrayDeclaration
src/utils/validateModel.ts:112:16
         level: "warning",
         code: "IDENT_NEEDS_QUOTING_ENTITY",
         message: `Имя таблицы «${raw}» требует экранирования (кавычек) в SQL.`,
-        where: [e.id],
+        where: [],
         suggestion: "Переименуйте таблицу в буквенно-цифровое имя с подчёркиванием, чтобы избежать кавычек."
       });

[Killed] MethodExpression
src/utils/validateModel.ts:115:29
         where: [e.id],
         suggestion: "Переименуйте таблицу в буквенно-цифровое имя с подчёркиванием, чтобы избежать кавычек."
       });
-    } else if (RESERVED.has(norm.toLowerCase())) {
+    } else if (RESERVED.has(norm.toUpperCase())) {
       issues.push({
         level: "warning",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 7ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 86ms

[Killed] ConditionalExpression
src/utils/validateModel.ts:115:16
         where: [e.id],
         suggestion: "Переименуйте таблицу в буквенно-цифровое имя с подчёркиванием, чтобы избежать кавычек."
       });
-    } else if (RESERVED.has(norm.toLowerCase())) {
+    } else if (false) {
       issues.push({
         level: "warning",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 7ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 154ms

[Survived] ArrayDeclaration
src/utils/validateModel.ts:120:16
         level: "warning",
         code: "RESERVED_WORD_ENTITY",
         message: `Имя таблицы «${raw}» совпадает с зарезервированным словом SQL.`,
-        where: [e.id],
+        where: [],
         suggestion: "Переименуйте таблицу или оставьте как есть (генератор процитирует имя)."
       });

[Killed] BlockStatement
src/utils/validateModel.ts:127:29
   }
 
   // --- 2) Повторяющиеся атрибуты в одной сущности ---
-  for (const e of entities) {
-    const seen = new Map<string, number>();
-    for (const a of e.attributes) {
-      const k = sanitize(a.name).toLowerCase();
-      seen.set(k, (seen.get(k) ?? 0) + 1);
-    }
-    const dups = [...seen.entries()].filter(([, n]) => n > 1);
-    if (dups.length > 0) {
-      issues.push({
-        level: "error",
-        code: "DUP_ATTR_NAME",
-        message: `В сущности «${e.name}» есть повторяющиеся атрибуты: ${dups.map(([k]) => k).join(", ")}.`,
-        where: [e.id],
-        suggestion: "Переименуйте дублирующиеся атрибуты.",
-      });
-    }
-  }
+  for (const e of entities) {}
 
   // --- 2a) Резерв/кавычки для атрибутов ---
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 7ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 2 failed) 112ms

[Killed] BlockStatement
src/utils/validateModel.ts:129:35
   // --- 2) Повторяющиеся атрибуты в одной сущности ---
   for (const e of entities) {
     const seen = new Map<string, number>();
-    for (const a of e.attributes) {
-      const k = sanitize(a.name).toLowerCase();
-      seen.set(k, (seen.get(k) ?? 0) + 1);
-    }
+    for (const a of e.attributes) {}
     const dups = [...seen.entries()].filter(([, n]) => n > 1);
     if (dups.length > 0) {
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 17ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 2 failed) 119ms
     ✓ негатив: повтор User/user → DUP_ENTITY_NAME 22ms

[Survived] MethodExpression
src/utils/validateModel.ts:130:17
   for (const e of entities) {
     const seen = new Map<string, number>();
     for (const a of e.attributes) {
-      const k = sanitize(a.name).toLowerCase();
+      const k = sanitize(a.name).toUpperCase();
       seen.set(k, (seen.get(k) ?? 0) + 1);
     }

[Timeout] ArithmeticOperator
src/utils/validateModel.ts:131:19
     const seen = new Map<string, number>();
     for (const a of e.attributes) {
       const k = sanitize(a.name).toLowerCase();
-      seen.set(k, (seen.get(k) ?? 0) + 1);
+      seen.set(k, (seen.get(k) ?? 0) - 1);
     }
     const dups = [...seen.entries()].filter(([, n]) => n > 1);

[Killed] ArrowFunction
src/utils/validateModel.ts:133:45
       const k = sanitize(a.name).toLowerCase();
       seen.set(k, (seen.get(k) ?? 0) + 1);
     }
-    const dups = [...seen.entries()].filter(([, n]) => n > 1);
+    const dups = [...seen.entries()].filter(() => undefined);
     if (dups.length > 0) {
       issues.push({
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 12ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 2 failed) 213ms

[Killed] ConditionalExpression
src/utils/validateModel.ts:133:56
       const k = sanitize(a.name).toLowerCase();
       seen.set(k, (seen.get(k) ?? 0) + 1);
     }
-    const dups = [...seen.entries()].filter(([, n]) => n > 1);
+    const dups = [...seen.entries()].filter(([, n]) => true);
     if (dups.length > 0) {
       issues.push({
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 7ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 20 failed) 147ms

[Killed] EqualityOperator
src/utils/validateModel.ts:134:9
       seen.set(k, (seen.get(k) ?? 0) + 1);
     }
     const dups = [...seen.entries()].filter(([, n]) => n > 1);
-    if (dups.length > 0) {
+    if (dups.length >= 0) {
       issues.push({
         level: "error",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 27ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 25 failed) 151ms

[Killed] ConditionalExpression
src/utils/validateModel.ts:134:9
       seen.set(k, (seen.get(k) ?? 0) + 1);
     }
     const dups = [...seen.entries()].filter(([, n]) => n > 1);
-    if (dups.length > 0) {
+    if (false) {
       issues.push({
         level: "error",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 13ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 2 failed) 112ms

[Killed] StringLiteral
src/utils/validateModel.ts:137:15
     if (dups.length > 0) {
       issues.push({
         level: "error",
-        code: "DUP_ATTR_NAME",
+        code: "",
         message: `В сущности «${e.name}» есть повторяющиеся атрибуты: ${dups.map(([k]) => k).join(", ")}.`,
         where: [e.id],
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 17ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 2 failed) 180ms
     ✓ негатив: повтор User/user → DUP_ENTITY_NAME 19ms

[Survived] ArrowFunction
src/utils/validateModel.ts:138:82
       issues.push({
         level: "error",
         code: "DUP_ATTR_NAME",
-        message: `В сущности «${e.name}» есть повторяющиеся атрибуты: ${dups.map(([k]) => k).join(", ")}.`,
+        message: `В сущности «${e.name}» есть повторяющиеся атрибуты: ${dups.map(() => undefined).join(", ")}.`,
         where: [e.id],
         suggestion: "Переименуйте дублирующиеся атрибуты.",

[Survived] StringLiteral
src/utils/validateModel.ts:138:18
       issues.push({
         level: "error",
         code: "DUP_ATTR_NAME",
-        message: `В сущности «${e.name}» есть повторяющиеся атрибуты: ${dups.map(([k]) => k).join(", ")}.`,
+        message: ``,
         where: [e.id],
         suggestion: "Переименуйте дублирующиеся атрибуты.",

[Killed] BlockStatement
src/utils/validateModel.ts:146:29
   }
 
   // --- 2a) Резерв/кавычки для атрибутов ---
-  for (const e of entities) {
-    for (const a of e.attributes) {
-      const raw = a.name;
-      const norm = sanitize(raw);
-      if (!IDENT_OK.test(norm)) {
-        issues.push({
-          level: "warning",
-          code: "IDENT_NEEDS_QUOTING_COLUMN",
-          message: `Столбец «${e.name}.${raw}» требует экранирования (кавычек) в SQL.`,
-          where: [e.id],
-          suggestion: "Переименуйте столбец под формат [A-Za-z_][A-Za-z0-9_]*."
-        });
-      } else if (RESERVED.has(norm.toLowerCase())) {
-        issues.push({
-          level: "warning",
-          code: "RESERVED_WORD_COLUMN",
-          message: `Столбец «${e.name}.${raw}» совпадает с зарезервированным словом SQL.`,
-          where: [e.id],
-          suggestion: "Переименуйте столбец или оставьте как есть (генератор процитирует имя)."
-        });
-      }
-    }
-  }
+  for (const e of entities) {}
 
   // Подготовка пар N:M и поиск «явных» линк-таблиц
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 8ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 2 failed) 222ms
