[Killed] BlockStatement
src/utils/validateModel.ts:147:35
 
   // --- 2a) Резерв/кавычки для атрибутов ---
   for (const e of entities) {
-    for (const a of e.attributes) {
-      const raw = a.name;
-      const norm = sanitize(raw);
-      if (!IDENT_OK.test(norm)) {
-        issues.push({
-          level: "warning",
-          code: "IDENT_NEEDS_QUOTING_COLUMN",
-          message: `Столбец «${e.name}.${raw}» требует экранирования (кавычек) в SQL.`,
-          where: [e.id],
-          suggestion: "Переименуйте столбец под формат [A-Za-z_][A-Za-z0-9_]*."
-        });
-      } else if (RESERVED.has(norm.toLowerCase())) {
-        issues.push({
-          level: "warning",
-          code: "RESERVED_WORD_COLUMN",
-          message: `Столбец «${e.name}.${raw}» совпадает с зарезервированным словом SQL.`,
-          where: [e.id],
-          suggestion: "Переименуйте столбец или оставьте как есть (генератор процитирует имя)."
-        });
-      }
-    }
+    for (const a of e.attributes) {}
   }
 
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 12ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 2 failed) 164ms

[Killed] BooleanLiteral
src/utils/validateModel.ts:150:11
     for (const a of e.attributes) {
       const raw = a.name;
       const norm = sanitize(raw);
-      if (!IDENT_OK.test(norm)) {
+      if (IDENT_OK.test(norm)) {
         issues.push({
           level: "warning",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 9ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 3 failed) 214ms

[Killed] ConditionalExpression
src/utils/validateModel.ts:150:11
     for (const a of e.attributes) {
       const raw = a.name;
       const norm = sanitize(raw);
-      if (!IDENT_OK.test(norm)) {
+      if (false) {
         issues.push({
           level: "warning",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 11ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 165ms

[Timeout] BlockStatement
src/utils/validateModel.ts:158:52
           where: [e.id],
           suggestion: "Переименуйте столбец под формат [A-Za-z_][A-Za-z0-9_]*."
         });
-      } else if (RESERVED.has(norm.toLowerCase())) {
-        issues.push({
-          level: "warning",
-          code: "RESERVED_WORD_COLUMN",
-          message: `Столбец «${e.name}.${raw}» совпадает с зарезервированным словом SQL.`,
-          where: [e.id],
-          suggestion: "Переименуйте столбец или оставьте как есть (генератор процитирует имя)."
-        });
-      }
+      } else if (RESERVED.has(norm.toLowerCase())) {}
     }
   }

[Timeout] StringLiteral
src/utils/validateModel.ts:161:17
       } else if (RESERVED.has(norm.toLowerCase())) {
         issues.push({
           level: "warning",
-          code: "RESERVED_WORD_COLUMN",
+          code: "",
           message: `Столбец «${e.name}.${raw}» совпадает с зарезервированным словом SQL.`,
           where: [e.id],

[Timeout] StringLiteral
src/utils/validateModel.ts:162:20
         issues.push({
           level: "warning",
           code: "RESERVED_WORD_COLUMN",
-          message: `Столбец «${e.name}.${raw}» совпадает с зарезервированным словом SQL.`,
+          message: ``,
           where: [e.id],
           suggestion: "Переименуйте столбец или оставьте как есть (генератор процитирует имя)."

[Timeout] StringLiteral
src/utils/validateModel.ts:164:23
           code: "RESERVED_WORD_COLUMN",
           message: `Столбец «${e.name}.${raw}» совпадает с зарезервированным словом SQL.`,
           where: [e.id],
-          suggestion: "Переименуйте столбец или оставьте как есть (генератор процитирует имя)."
+          suggestion: ""
         });
       }

[Timeout] BlockStatement
src/utils/validateModel.ts:185:28
   const deferredLinkTables = new Set<string>();
 
   // Найти явные link-сущности по имени
-  for (const p of mmPairs) {
-    const link = findExistingLinkEntity(p.from, p.to, entities);
-    linkEntityByPair.set(p.key, link ?? null);
-    if (link && link.attributes.length === 0) {
-      deferredLinkTables.add(sanitize(link.name));
-      issues.push({
-        level: "info",
-        code: "EMPTY_LINK_ENTITY",
-        message: `Линк-таблица «${link.name}» пустая — будет создана целиком на этапе связей с FK и PK.`,
-        where: [link.id],
-        suggestion: "Можно заранее указать имена столбцов в инспекторе связи (left/right), если нужно.",
-      });
-    }
-  }
+  for (const p of mmPairs) {}
 
   // --- 3) Пустые сущности / отсутствующие PK ---

[Killed] LogicalOperator
src/utils/validateModel.ts:187:33
   // Найти явные link-сущности по имени
   for (const p of mmPairs) {
     const link = findExistingLinkEntity(p.from, p.to, entities);
-    linkEntityByPair.set(p.key, link ?? null);
+    linkEntityByPair.set(p.key, link && null);
     if (link && link.attributes.length === 0) {
       deferredLinkTables.add(sanitize(link.name));
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh


 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 18ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 2 failed) 107ms

     ✓ негатив: повтор User/user → DUP_ENTITY_NAME 24ms

[Killed] BlockStatement
src/utils/validateModel.ts:188:47
   for (const p of mmPairs) {
     const link = findExistingLinkEntity(p.from, p.to, entities);
     linkEntityByPair.set(p.key, link ?? null);
-    if (link && link.attributes.length === 0) {
-      deferredLinkTables.add(sanitize(link.name));
-      issues.push({
-        level: "info",
-        code: "EMPTY_LINK_ENTITY",
-        message: `Линк-таблица «${link.name}» пустая — будет создана целиком на этапе связей с FK и PK.`,
-        where: [link.id],
-        suggestion: "Можно заранее указать имена столбцов в инспекторе связи (left/right), если нужно.",
-      });
-    }
+    if (link && link.attributes.length === 0) {}
   }
 
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 8ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 140ms

[Killed] EqualityOperator
src/utils/validateModel.ts:188:17
   for (const p of mmPairs) {
     const link = findExistingLinkEntity(p.from, p.to, entities);
     linkEntityByPair.set(p.key, link ?? null);
-    if (link && link.attributes.length === 0) {
+    if (link && link.attributes.length !== 0) {
       deferredLinkTables.add(sanitize(link.name));
       issues.push({
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 13ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 94ms

[Killed] ConditionalExpression
src/utils/validateModel.ts:202:21
 
   // --- 3) Пустые сущности / отсутствующие PK ---
   for (const e of entities) {
-    const isEmpty = e.attributes.length === 0;
+    const isEmpty = false;
     const participates = hasAnyRelations(e.id);
 
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 11ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 4 failed) 117ms

[Killed] EqualityOperator
src/utils/validateModel.ts:202:21
 
   // --- 3) Пустые сущности / отсутствующие PK ---
   for (const e of entities) {
-    const isEmpty = e.attributes.length === 0;
+    const isEmpty = e.attributes.length !== 0;
     const participates = hasAnyRelations(e.id);
 
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 18ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 5 failed) 124ms

[Killed] MethodExpression
src/utils/validateModel.ts:206:28
     const participates = hasAnyRelations(e.id);
 
     // Если это не явная link-таблица
-    const isExplicitLink = [...linkEntityByPair.values()].some(le => le?.id === e.id);
+    const isExplicitLink = [...linkEntityByPair.values()].every(le => le?.id === e.id);
 
     if (isEmpty && !isExplicitLink) {
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 9ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 5 failed) 110ms

[Survived] ConditionalExpression
src/utils/validateModel.ts:206:70
     const participates = hasAnyRelations(e.id);
 
     // Если это не явная link-таблица
-    const isExplicitLink = [...linkEntityByPair.values()].some(le => le?.id === e.id);
+    const isExplicitLink = [...linkEntityByPair.values()].some(le => false);
 
     if (isEmpty && !isExplicitLink) {

[Killed] ConditionalExpression
src/utils/validateModel.ts:208:9
     // Если это не явная link-таблица
     const isExplicitLink = [...linkEntityByPair.values()].some(le => le?.id === e.id);
 
-    if (isEmpty && !isExplicitLink) {
+    if (true) {
       if (!participates) {
         issues.push({
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 6ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 2 failed) 193ms

[Killed] ConditionalExpression
src/utils/validateModel.ts:208:9
     // Если это не явная link-таблица
     const isExplicitLink = [...linkEntityByPair.values()].some(le => le?.id === e.id);
 
-    if (isEmpty && !isExplicitLink) {
+    if (false) {
       if (!participates) {
         issues.push({
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 8ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 4 failed) 164ms

[Killed] BlockStatement
src/utils/validateModel.ts:209:26
     const isExplicitLink = [...linkEntityByPair.values()].some(le => le?.id === e.id);
 
     if (isEmpty && !isExplicitLink) {
-      if (!participates) {
-        issues.push({
-          level: "warning",
-          code: "EMPTY_ENTITY_SKIPPED",
-          message: `Сущность «${e.name}» пустая и не участвует в связях — в SQL она не будет создана.`,
-          where: [e.id],
-          suggestion: "Добавьте атрибуты или свяжите сущность с другими таблицами.",
-        });
-        continue;
-      } else {
+      if (!participates) {} else {
         issues.push({
           level: "info",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 10ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 3 failed) 130ms

[Killed] ConditionalExpression
src/utils/validateModel.ts:209:11
     const isExplicitLink = [...linkEntityByPair.values()].some(le => le?.id === e.id);
 
     if (isEmpty && !isExplicitLink) {
-      if (!participates) {
+      if (false) {
         issues.push({
           level: "warning",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 9ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 3 failed) 106ms

[Survived] StringLiteral
src/utils/validateModel.ts:213:20
         issues.push({
           level: "warning",
           code: "EMPTY_ENTITY_SKIPPED",
-          message: `Сущность «${e.name}» пустая и не участвует в связях — в SQL она не будет создана.`,
+          message: ``,
           where: [e.id],
           suggestion: "Добавьте атрибуты или свяжите сущность с другими таблицами.",

[Killed] BlockStatement
src/utils/validateModel.ts:218:14
           suggestion: "Добавьте атрибуты или свяжите сущность с другими таблицами.",
         });
         continue;
-      } else {
-        issues.push({
-          level: "info",
-          code: "EMPTY_ENTITY_WITH_RELS",
-          message: `Сущность «${e.name}» пустая, но участвует в связях — таблица будет создана, FK-колонки добавятся на этапе связей.`,
-          where: [e.id],
-        });
-        continue;
-      }
+      } else {}
     }
 
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 9ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 404ms

[Killed] StringLiteral
src/utils/validateModel.ts:221:17
       } else {
         issues.push({
           level: "info",
-          code: "EMPTY_ENTITY_WITH_RELS",
+          code: "",
           message: `Сущность «${e.name}» пустая, но участвует в связях — таблица будет создана, FK-колонки добавятся на этапе связей.`,
           where: [e.id],
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 10ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 99ms

[Survived] StringLiteral
src/utils/validateModel.ts:222:20
         issues.push({
           level: "info",
           code: "EMPTY_ENTITY_WITH_RELS",
-          message: `Сущность «${e.name}» пустая, но участвует в связях — таблица будет создана, FK-колонки добавятся на этапе связей.`,
+          message: ``,
           where: [e.id],
         });

[Killed] BooleanLiteral
src/utils/validateModel.ts:230:9
     }
 
     // Нет PK у сущности (не link) → генератор добавит surrogate PK
-    if (!isExplicitLink) {
+    if (isExplicitLink) {
       const hasPk = e.attributes.some(a => (a as any).isPrimaryKey);
       if (!hasPk) {
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 12ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 67ms

[Killed] BlockStatement
src/utils/validateModel.ts:230:26
     }
 
     // Нет PK у сущности (не link) → генератор добавит surrogate PK
-    if (!isExplicitLink) {
-      const hasPk = e.attributes.some(a => (a as any).isPrimaryKey);
-      if (!hasPk) {
-        issues.push({
-          level: "info",
-          code: "MISSING_PK",
-          message: `В сущности «${e.name}» явный первичный ключ не задан — будет добавлен surrogate PK (id).`,
-          where: [e.id],
-          suggestion: "Можно явно отметить PK в карточке сущности (🔑), если нужно.",
-        });
-      }
-    }
+    if (!isExplicitLink) {}
   }
 
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 11ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 118ms

[Survived] ArrowFunction
src/utils/validateModel.ts:231:39
 
     // Нет PK у сущности (не link) → генератор добавит surrogate PK
     if (!isExplicitLink) {
-      const hasPk = e.attributes.some(a => (a as any).isPrimaryKey);
+      const hasPk = e.attributes.some(() => undefined);
       if (!hasPk) {
         issues.push({

[Survived] MethodExpression
src/utils/validateModel.ts:231:21
 
     // Нет PK у сущности (не link) → генератор добавит surrogate PK
     if (!isExplicitLink) {
-      const hasPk = e.attributes.some(a => (a as any).isPrimaryKey);
+      const hasPk = e.attributes.every(a => (a as any).isPrimaryKey);
       if (!hasPk) {
         issues.push({

[Killed] ConditionalExpression
src/utils/validateModel.ts:232:11
     // Нет PK у сущности (не link) → генератор добавит surrogate PK
     if (!isExplicitLink) {
       const hasPk = e.attributes.some(a => (a as any).isPrimaryKey);
-      if (!hasPk) {
+      if (false) {
         issues.push({
           level: "info",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 13ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 73ms

[Killed] BooleanLiteral
src/utils/validateModel.ts:232:11
     // Нет PK у сущности (не link) → генератор добавит surrogate PK
     if (!isExplicitLink) {
       const hasPk = e.attributes.some(a => (a as any).isPrimaryKey);
-      if (!hasPk) {
+      if (hasPk) {
         issues.push({
           level: "info",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 13ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 80ms

[Killed] StringLiteral
src/utils/validateModel.ts:235:17
       if (!hasPk) {
         issues.push({
           level: "info",
-          code: "MISSING_PK",
+          code: "",
           message: `В сущности «${e.name}» явный первичный ключ не задан — будет добавлен surrogate PK (id).`,
           where: [e.id],
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 18ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 90ms

[Killed] BlockStatement
src/utils/validateModel.ts:245:29
   }
 
   // --- 3a) Несвязанная, но непустая сущность ---
-  for (const e of entities) {
-    if (e.attributes.length > 0 && !hasAnyRelations(e.id)) {
-      issues.push({
-        level: "warning",
-        code: "LONELY_ENTITY",
-        message: `Сущность «${e.name}» не участвует ни в одной связи.`,
-        where: [e.id],
-        suggestion: "Проверьте модель: возможно, забыта связь с другой сущностью.",
-      });
-    }
-  }
+  for (const e of entities) {}
 
   // --- 3b) Self-link по parent_*_id (если связи нет) ---
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 10ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 117ms

[Killed] ConditionalExpression
src/utils/validateModel.ts:246:9
 
   // --- 3a) Несвязанная, но непустая сущность ---
   for (const e of entities) {
-    if (e.attributes.length > 0 && !hasAnyRelations(e.id)) {
+    if (false) {
       issues.push({
         level: "warning",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 11ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 107ms

[Killed] BooleanLiteral
src/utils/validateModel.ts:246:36
 
   // --- 3a) Несвязанная, но непустая сущность ---
   for (const e of entities) {
-    if (e.attributes.length > 0 && !hasAnyRelations(e.id)) {
+    if (e.attributes.length > 0 && hasAnyRelations(e.id)) {
       issues.push({
         level: "warning",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 17ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 136ms

[Killed] BlockStatement
src/utils/validateModel.ts:258:29
   }
 
   // --- 3b) Self-link по parent_*_id (если связи нет) ---
-  for (const e of entities) {
-    const parentAttr = e.attributes.find(a => /^parent_.*_id$/i.test(sanitize(a.name)));
-    if (parentAttr && !hasSelfRelation(e.id, relationships)) {
-      issues.push({
-        level: "warning",
-        code: "MISSING_SELF_LINK",
-        message: `В «${e.name}» есть «${parentAttr.name}», но нет самосвязи 1:N (родитель→ребёнок).`,
-        where: [e.id],
-        suggestion: `Добавьте связь 1:N ${e.name}→${e.name} и укажите FK «${sanitize(parentAttr.name)}» (обычно допускается NULL).`,
-      });
-    }
-  }
+  for (const e of entities) {}
 
   // --- 3c) Таблица с двумя *_id без связи M:N ---
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 10ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 104ms

[Killed] ArrowFunction
src/utils/validateModel.ts:259:42
 
   // --- 3b) Self-link по parent_*_id (если связи нет) ---
   for (const e of entities) {
-    const parentAttr = e.attributes.find(a => /^parent_.*_id$/i.test(sanitize(a.name)));
+    const parentAttr = e.attributes.find(() => undefined);
     if (parentAttr && !hasSelfRelation(e.id, relationships)) {
       issues.push({
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 6ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 105ms

[Killed] Regex
src/utils/validateModel.ts:259:47
 
   // --- 3b) Self-link по parent_*_id (если связи нет) ---
   for (const e of entities) {
-    const parentAttr = e.attributes.find(a => /^parent_.*_id$/i.test(sanitize(a.name)));
+    const parentAttr = e.attributes.find(a => /^parent_._id$/i.test(sanitize(a.name)));
     if (parentAttr && !hasSelfRelation(e.id, relationships)) {
       issues.push({
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 6ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 91ms

[Killed] BlockStatement
src/utils/validateModel.ts:260:62
   // --- 3b) Self-link по parent_*_id (если связи нет) ---
   for (const e of entities) {
     const parentAttr = e.attributes.find(a => /^parent_.*_id$/i.test(sanitize(a.name)));
-    if (parentAttr && !hasSelfRelation(e.id, relationships)) {
-      issues.push({
-        level: "warning",
-        code: "MISSING_SELF_LINK",
-        message: `В «${e.name}» есть «${parentAttr.name}», но нет самосвязи 1:N (родитель→ребёнок).`,
-        where: [e.id],
-        suggestion: `Добавьте связь 1:N ${e.name}→${e.name} и укажите FK «${sanitize(parentAttr.name)}» (обычно допускается NULL).`,
-      });
-    }
+    if (parentAttr && !hasSelfRelation(e.id, relationships)) {}
   }
 
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 8ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 94ms

[Killed] BooleanLiteral
src/utils/validateModel.ts:260:23
   // --- 3b) Self-link по parent_*_id (если связи нет) ---
   for (const e of entities) {
     const parentAttr = e.attributes.find(a => /^parent_.*_id$/i.test(sanitize(a.name)));
-    if (parentAttr && !hasSelfRelation(e.id, relationships)) {
+    if (parentAttr && hasSelfRelation(e.id, relationships)) {
       issues.push({
         level: "warning",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 15ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 101ms

[Killed] BlockStatement
src/utils/validateModel.ts:272:29
   }
 
   // --- 3c) Таблица с двумя *_id без связи M:N ---
-  for (const e of entities) {
-    const idCols = countIdCols(e);
-    if (idCols.length !== 2) continue;
-
-    const [l, r] = idCols;
-    const lEnt = findEntityByRootName(entities, l.replace(/_id$/i, ""));
-    const rEnt = findEntityByRootName(entities, r.replace(/_id$/i, ""));
-    if (!lEnt || !rEnt || lEnt.id === rEnt.id) continue;
-
-    const hasMM = relationships.some(
-      rr => rr.type === "many-to-many" &&
-        ((rr.from === lEnt.id && rr.to === rEnt.id) || (rr.from === rEnt.id && rr.to === lEnt.id))
-    );
-    if (!hasMM) {
-      issues.push({
-        level: "warning",
-        code: "TWO_ID_TABLE_NO_MM",
-        message: `Таблица «${e.name}» похожа на link-таблицу (ровно две *_id: «${l}», «${r}»), но связи M:N между сущностями не найдено.`,
-        where: [e.id],
-        suggestion: "Оформите её как связь M:N в инспекторе (укажите link-таблицу и оба FK) либо сделайте 1:N/1:1 явно.",
-      });
-    }
-  }
+  for (const e of entities) {}
 
   // --- 4) Проверки по связям ---
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 10ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 125ms

[Killed] EqualityOperator
src/utils/validateModel.ts:274:9
   // --- 3c) Таблица с двумя *_id без связи M:N ---
   for (const e of entities) {
     const idCols = countIdCols(e);
-    if (idCols.length !== 2) continue;
+    if (idCols.length === 2) continue;
 
     const [l, r] = idCols;
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 14ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 36 failed) 314ms

[Killed] ConditionalExpression
src/utils/validateModel.ts:274:9
   // --- 3c) Таблица с двумя *_id без связи M:N ---
   for (const e of entities) {
     const idCols = countIdCols(e);
-    if (idCols.length !== 2) continue;
+    if (false) continue;
 
     const [l, r] = idCols;
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 7ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 36 failed) 300ms

[Survived] Regex
src/utils/validateModel.ts:277:59
     if (idCols.length !== 2) continue;
 
     const [l, r] = idCols;
-    const lEnt = findEntityByRootName(entities, l.replace(/_id$/i, ""));
+    const lEnt = findEntityByRootName(entities, l.replace(/_id/i, ""));
     const rEnt = findEntityByRootName(entities, r.replace(/_id$/i, ""));
     if (!lEnt || !rEnt || lEnt.id === rEnt.id) continue;

[Killed] EqualityOperator
src/utils/validateModel.ts:279:27
     const [l, r] = idCols;
     const lEnt = findEntityByRootName(entities, l.replace(/_id$/i, ""));
     const rEnt = findEntityByRootName(entities, r.replace(/_id$/i, ""));
-    if (!lEnt || !rEnt || lEnt.id === rEnt.id) continue;
+    if (!lEnt || !rEnt || lEnt.id !== rEnt.id) continue;
 
     const hasMM = relationships.some(
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 15ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 171ms

[Survived] ConditionalExpression
src/utils/validateModel.ts:279:27
     const [l, r] = idCols;
     const lEnt = findEntityByRootName(entities, l.replace(/_id$/i, ""));
     const rEnt = findEntityByRootName(entities, r.replace(/_id$/i, ""));
-    if (!lEnt || !rEnt || lEnt.id === rEnt.id) continue;
+    if (!lEnt || !rEnt || false) continue;
 
     const hasMM = relationships.some(

[Killed] MethodExpression
src/utils/validateModel.ts:281:19
     const rEnt = findEntityByRootName(entities, r.replace(/_id$/i, ""));
     if (!lEnt || !rEnt || lEnt.id === rEnt.id) continue;
 
-    const hasMM = relationships.some(
-      rr => rr.type === "many-to-many" &&
-        ((rr.from === lEnt.id && rr.to === rEnt.id) || (rr.from === rEnt.id && rr.to === lEnt.id))
-    );
+    const hasMM = relationships.every(rr => rr.type === "many-to-many" && (rr.from === lEnt.id && rr.to === rEnt.id || rr.from === rEnt.id && rr.to === lEnt.id));
     if (!hasMM) {
       issues.push({
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 13ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 129ms

[Survived] ConditionalExpression
src/utils/validateModel.ts:282:13
     if (!lEnt || !rEnt || lEnt.id === rEnt.id) continue;
 
     const hasMM = relationships.some(
-      rr => rr.type === "many-to-many" &&
-        ((rr.from === lEnt.id && rr.to === rEnt.id) || (rr.from === rEnt.id && rr.to === lEnt.id))
+      rr => true
     );
     if (!hasMM) {

[Survived] ConditionalExpression
src/utils/validateModel.ts:282:13
     if (!lEnt || !rEnt || lEnt.id === rEnt.id) continue;
 
     const hasMM = relationships.some(
-      rr => rr.type === "many-to-many" &&
+      rr => true &&
         ((rr.from === lEnt.id && rr.to === rEnt.id) || (rr.from === rEnt.id && rr.to === lEnt.id))
     );

[Survived] LogicalOperator
src/utils/validateModel.ts:283:10
 
     const hasMM = relationships.some(
       rr => rr.type === "many-to-many" &&
-        ((rr.from === lEnt.id && rr.to === rEnt.id) || (rr.from === rEnt.id && rr.to === lEnt.id))
+        (rr.from === lEnt.id && rr.to === rEnt.id && rr.from === rEnt.id && rr.to === lEnt.id)
     );
     if (!hasMM) {

[Survived] LogicalOperator
src/utils/validateModel.ts:283:11
 
     const hasMM = relationships.some(
       rr => rr.type === "many-to-many" &&
-        ((rr.from === lEnt.id && rr.to === rEnt.id) || (rr.from === rEnt.id && rr.to === lEnt.id))
+        ((rr.from === lEnt.id || rr.to === rEnt.id) || (rr.from === rEnt.id && rr.to === lEnt.id))
     );
     if (!hasMM) {
