[Killed] ConditionalExpression
src/utils/validateModel.ts:285:9
       rr => rr.type === "many-to-many" &&
         ((rr.from === lEnt.id && rr.to === rEnt.id) || (rr.from === rEnt.id && rr.to === lEnt.id))
     );
-    if (!hasMM) {
+    if (false) {
       issues.push({
         level: "warning",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 11ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 91ms

[Killed] BooleanLiteral
src/utils/validateModel.ts:285:9
       rr => rr.type === "many-to-many" &&
         ((rr.from === lEnt.id && rr.to === rEnt.id) || (rr.from === rEnt.id && rr.to === lEnt.id))
     );
-    if (!hasMM) {
+    if (hasMM) {
       issues.push({
         level: "warning",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 9ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 113ms

[Survived] StringLiteral
src/utils/validateModel.ts:289:18
       issues.push({
         level: "warning",
         code: "TWO_ID_TABLE_NO_MM",
-        message: `Таблица «${e.name}» похожа на link-таблицу (ровно две *_id: «${l}», «${r}»), но связи M:N между сущностями не найдено.`,
+        message: ``,
         where: [e.id],
         suggestion: "Оформите её как связь M:N в инспекторе (укажите link-таблицу и оба FK) либо сделайте 1:N/1:1 явно.",

[Killed] ConditionalExpression
src/utils/validateModel.ts:310:9
     const fromSing = toSingular(fromName);
     const toSing   = toSingular(toName);
 
-    if (r.type === "one-to-one" || r.type === "one-to-many") {
+    if (true) {
       // Ищем существующую FK-колонку или ту, что попросил пользователь в инспекторе
       const desiredCol =
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 9ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 82ms

[Killed] ConditionalExpression
src/utils/validateModel.ts:310:36
     const fromSing = toSingular(fromName);
     const toSing   = toSingular(toName);
 
-    if (r.type === "one-to-one" || r.type === "one-to-many") {
+    if (r.type === "one-to-one" || false) {
       // Ищем существующую FK-колонку или ту, что попросил пользователь в инспекторе
       const desiredCol =
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 12ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 2 failed) 85ms

[Timeout] LogicalOperator
src/utils/validateModel.ts:313:9
     if (r.type === "one-to-one" || r.type === "one-to-many") {
       // Ищем существующую FK-колонку или ту, что попросил пользователь в инспекторе
       const desiredCol =
-        (r.fk?.column && sanitize(r.fk.column)) ||
-        findExistingFKColumn(to, fromName, fromSing, fromPK.name) ||
+        r.fk?.column && sanitize(r.fk.column) && findExistingFKColumn(to, fromName, fromSing, fromPK.name) ||
         null;
 

[Survived] ConditionalExpression
src/utils/validateModel.ts:313:10
     if (r.type === "one-to-one" || r.type === "one-to-many") {
       // Ищем существующую FK-колонку или ту, что попросил пользователь в инспекторе
       const desiredCol =
-        (r.fk?.column && sanitize(r.fk.column)) ||
+        (false) ||
         findExistingFKColumn(to, fromName, fromSing, fromPK.name) ||
         null;

[Killed] BlockStatement
src/utils/validateModel.ts:318:52
         null;
 
       // Если колонка существует → проверить совместимость типов
-      if (desiredCol && hasColumn(to, desiredCol)) {
-        const fkAttr = to.attributes.find(a => sanitize(a.name).toLowerCase() === desiredCol.toLowerCase());
-        const fkType = fkAttr?.type || "";
-        if (fkType && normType(fkType) !== normType(fromPK.type)) {
-          issues.push({
-            level: "error",
-            code: "FK_TYPE_MISMATCH",
-            message:
-              `Связь ${r.type} ${from.name}→${to.name}: тип FK-столбца «${desiredCol}» (${fkType}) ` +
-              `не совпадает с типом PK «${from.name}.${fromPK.name}» (${fromPK.type}).`,
-            where: [to.id],
-            suggestion: `Выравняйте типы (например, смените тип «${desiredCol}» на ${fromPK.type}).`,
-          });
-        }
-      } else {
+      if (desiredCol && hasColumn(to, desiredCol)) {} else {
         // Колонки нет — генератор добавит;
         const autoCol = sanitize((r.fk?.column) || `${snake(fromSing)}_${snake(fromPK.name)}`);
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 6ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 113ms

[Killed] ConditionalExpression
src/utils/validateModel.ts:319:48
 
       // Если колонка существует → проверить совместимость типов
       if (desiredCol && hasColumn(to, desiredCol)) {
-        const fkAttr = to.attributes.find(a => sanitize(a.name).toLowerCase() === desiredCol.toLowerCase());
+        const fkAttr = to.attributes.find(a => false);
         const fkType = fkAttr?.type || "";
         if (fkType && normType(fkType) !== normType(fromPK.type)) {
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 7ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 113ms

[Killed] ArrowFunction
src/utils/validateModel.ts:319:43
 
       // Если колонка существует → проверить совместимость типов
       if (desiredCol && hasColumn(to, desiredCol)) {
-        const fkAttr = to.attributes.find(a => sanitize(a.name).toLowerCase() === desiredCol.toLowerCase());
+        const fkAttr = to.attributes.find(() => undefined);
         const fkType = fkAttr?.type || "";
         if (fkType && normType(fkType) !== normType(fromPK.type)) {
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 13ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 92ms

[Killed] LogicalOperator
src/utils/validateModel.ts:320:24
       // Если колонка существует → проверить совместимость типов
       if (desiredCol && hasColumn(to, desiredCol)) {
         const fkAttr = to.attributes.find(a => sanitize(a.name).toLowerCase() === desiredCol.toLowerCase());
-        const fkType = fkAttr?.type || "";
+        const fkType = fkAttr?.type && "";
         if (fkType && normType(fkType) !== normType(fromPK.type)) {
           issues.push({
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 10ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 97ms

[Killed] ConditionalExpression
src/utils/validateModel.ts:320:24
       // Если колонка существует → проверить совместимость типов
       if (desiredCol && hasColumn(to, desiredCol)) {
         const fkAttr = to.attributes.find(a => sanitize(a.name).toLowerCase() === desiredCol.toLowerCase());
-        const fkType = fkAttr?.type || "";
+        const fkType = false;
         if (fkType && normType(fkType) !== normType(fromPK.type)) {
           issues.push({
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 12ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 91ms

[Killed] BlockStatement
src/utils/validateModel.ts:321:67
       if (desiredCol && hasColumn(to, desiredCol)) {
         const fkAttr = to.attributes.find(a => sanitize(a.name).toLowerCase() === desiredCol.toLowerCase());
         const fkType = fkAttr?.type || "";
-        if (fkType && normType(fkType) !== normType(fromPK.type)) {
-          issues.push({
-            level: "error",
-            code: "FK_TYPE_MISMATCH",
-            message:
-              `Связь ${r.type} ${from.name}→${to.name}: тип FK-столбца «${desiredCol}» (${fkType}) ` +
-              `не совпадает с типом PK «${from.name}.${fromPK.name}» (${fromPK.type}).`,
-            where: [to.id],
-            suggestion: `Выравняйте типы (например, смените тип «${desiredCol}» на ${fromPK.type}).`,
-          });
-        }
+        if (fkType && normType(fkType) !== normType(fromPK.type)) {}
       } else {
         // Колонки нет — генератор добавит;
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 6ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 89ms

[Killed] LogicalOperator
src/utils/validateModel.ts:321:13
       if (desiredCol && hasColumn(to, desiredCol)) {
         const fkAttr = to.attributes.find(a => sanitize(a.name).toLowerCase() === desiredCol.toLowerCase());
         const fkType = fkAttr?.type || "";
-        if (fkType && normType(fkType) !== normType(fromPK.type)) {
+        if (fkType || normType(fkType) !== normType(fromPK.type)) {
           issues.push({
             level: "error",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 10ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 153ms

[Killed] StringLiteral
src/utils/validateModel.ts:324:19
         if (fkType && normType(fkType) !== normType(fromPK.type)) {
           issues.push({
             level: "error",
-            code: "FK_TYPE_MISMATCH",
+            code: "",
             message:
               `Связь ${r.type} ${from.name}→${to.name}: тип FK-столбца «${desiredCol}» (${fkType}) ` +
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 8ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 108ms

[Survived] StringLiteral
src/utils/validateModel.ts:329:25
               `Связь ${r.type} ${from.name}→${to.name}: тип FK-столбца «${desiredCol}» (${fkType}) ` +
               `не совпадает с типом PK «${from.name}.${fromPK.name}» (${fromPK.type}).`,
             where: [to.id],
-            suggestion: `Выравняйте типы (например, смените тип «${desiredCol}» на ${fromPK.type}).`,
+            suggestion: ``,
           });
         }

[Killed] BlockStatement
src/utils/validateModel.ts:332:14
             suggestion: `Выравняйте типы (например, смените тип «${desiredCol}» на ${fromPK.type}).`,
           });
         }
-      } else {
-        // Колонки нет — генератор добавит;
-        const autoCol = sanitize((r.fk?.column) || `${snake(fromSing)}_${snake(fromPK.name)}`);
-        issues.push({
-          level: "info",
-          code: "FK_WILL_BE_ADDED",
-          message:
-            `Связь ${r.type} ${from.name}→${to.name}: будет добавлен столбец «${autoCol} ${fromPK.type}» ` +
-            `с FOREIGN KEY на ${from.name}(${fromPK.name}).`,
-          where: [to.id],
-        });
-      }
+      } else {}
 
       // Для 1:1 генератор добавляет UNIQUE на FK (если не отключено)
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 6ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 107ms

[Killed] StringLiteral
src/utils/validateModel.ts:334:52
         }
       } else {
         // Колонки нет — генератор добавит;
-        const autoCol = sanitize((r.fk?.column) || `${snake(fromSing)}_${snake(fromPK.name)}`);
+        const autoCol = sanitize((r.fk?.column) || ``);
         issues.push({
           level: "info",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 6ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 85ms

[Killed] StringLiteral
src/utils/validateModel.ts:339:13
           level: "info",
           code: "FK_WILL_BE_ADDED",
           message:
-            `Связь ${r.type} ${from.name}→${to.name}: будет добавлен столбец «${autoCol} ${fromPK.type}» ` +
+            `` +
             `с FOREIGN KEY на ${from.name}(${fromPK.name}).`,
           where: [to.id],
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 16ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 95ms

[Killed] EqualityOperator
src/utils/validateModel.ts:346:11
       }
 
       // Для 1:1 генератор добавляет UNIQUE на FK (если не отключено)
-      if (r.type === "one-to-one" && (r.fk?.unique !== false)) {
+      if (r.type !== "one-to-one" && (r.fk?.unique !== false)) {
         issues.push({
           level: "info",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 8ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 93ms

[Killed] EqualityOperator
src/utils/validateModel.ts:346:39
       }
 
       // Для 1:1 генератор добавляет UNIQUE на FK (если не отключено)
-      if (r.type === "one-to-one" && (r.fk?.unique !== false)) {
+      if (r.type === "one-to-one" && (r.fk?.unique === false)) {
         issues.push({
           level: "info",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 7ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 87ms

[Killed] EqualityOperator
src/utils/validateModel.ts:357:9
       }
     }
 
-    if (r.type === "many-to-many") {
+    if (r.type !== "many-to-many") {
       const key = `${from.id}__${to.id}`;
       const explicit = linkEntityByPair.get(key);
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 10ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 3 failed) 145ms

[Survived] ConditionalExpression
src/utils/validateModel.ts:357:9
       }
     }
 
-    if (r.type === "many-to-many") {
+    if (true) {
       const key = `${from.id}__${to.id}`;
       const explicit = linkEntityByPair.get(key);

[Killed] BlockStatement
src/utils/validateModel.ts:361:22
       const key = `${from.id}__${to.id}`;
       const explicit = linkEntityByPair.get(key);
 
-      if (!explicit) {
-        const autoName = `${snake(fromName)}_${snake(toName)}_link`;
-        issues.push({
-          level: "info",
-          code: "IMPLICIT_LINK_TABLE",
-          message:
-            `Связь N:M ${from.name}↔${to.name}: будет создана линк-таблица «${autoName}» ` +
-            `с колонками ${fkCol(fromSing, fromPK.name)} и ${fkCol(toSing, toPK.name)} + композитный PK.`,
-        });
-      } else {
+      if (!explicit) {} else {
         const linkName = sanitize(explicit.name);
         const leftCol  = sanitize(r.link?.leftColumn  || fkCol(fromSing, fromPK.name));
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 9ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 78ms

[Killed] StringLiteral
src/utils/validateModel.ts:362:26
       const explicit = linkEntityByPair.get(key);
 
       if (!explicit) {
-        const autoName = `${snake(fromName)}_${snake(toName)}_link`;
+        const autoName = ``;
         issues.push({
           level: "info",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 8ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 86ms

[Killed] StringLiteral
src/utils/validateModel.ts:365:17
         const autoName = `${snake(fromName)}_${snake(toName)}_link`;
         issues.push({
           level: "info",
-          code: "IMPLICIT_LINK_TABLE",
+          code: "",
           message:
             `Связь N:M ${from.name}↔${to.name}: будет создана линк-таблица «${autoName}» ` +
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 9ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 79ms

[Killed] EqualityOperator
src/utils/validateModel.ts:376:13
         const rightCol = sanitize(r.link?.rightColumn || fkCol(toSing,   toPK.name));
 
         // Пустая (отложенная) — уже отметили выше как info
-        if (explicit.attributes.length > 0) {
+        if (explicit.attributes.length <= 0) {
           // Если у явной линк-таблицы нет нужных FK-колонок — генератор добавит/доприведёт
           const leftExists  = hasColumn(explicit, leftCol);
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 13ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 2 failed) 102ms

[Survived] EqualityOperator
src/utils/validateModel.ts:376:13
         const rightCol = sanitize(r.link?.rightColumn || fkCol(toSing,   toPK.name));
 
         // Пустая (отложенная) — уже отметили выше как info
-        if (explicit.attributes.length > 0) {
+        if (explicit.attributes.length >= 0) {
           // Если у явной линк-таблицы нет нужных FK-колонок — генератор добавит/доприведёт
           const leftExists  = hasColumn(explicit, leftCol);

[Killed] BlockStatement
src/utils/validateModel.ts:381:44
           const leftExists  = hasColumn(explicit, leftCol);
           const rightExists = hasColumn(explicit, rightCol);
 
-          if (!leftExists || !rightExists) {
-            issues.push({
-              level: "info",
-              code: "LINK_FK_WILL_BE_ADDED",
-              message:
-                `Линк-таблица «${linkName}»: будут добавлены столбцы ` +
-                `${leftExists ? "" : `"${leftCol} ${fromPK.type}" `}` +
-                `${rightExists ? "" : `"${rightCol} ${toPK.type}" `}`.trim() +
-                ` и соответствующие FOREIGN KEY.`,
-              where: [explicit.id],
-            });
-          }
+          if (!leftExists || !rightExists) {}
 
           // Композитный PK, если не отключён и ещё не задан вручную
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 10ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 66ms

[Survived] BooleanLiteral
src/utils/validateModel.ts:381:30
           const leftExists  = hasColumn(explicit, leftCol);
           const rightExists = hasColumn(explicit, rightCol);
 
-          if (!leftExists || !rightExists) {
+          if (!leftExists || rightExists) {
             issues.push({
               level: "info",

[Killed] StringLiteral
src/utils/validateModel.ts:384:21
           if (!leftExists || !rightExists) {
             issues.push({
               level: "info",
-              code: "LINK_FK_WILL_BE_ADDED",
+              code: "",
               message:
                 `Линк-таблица «${linkName}»: будут добавлены столбцы ` +
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 6ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 93ms

[Survived] StringLiteral
src/utils/validateModel.ts:386:17
               level: "info",
               code: "LINK_FK_WILL_BE_ADDED",
               message:
-                `Линк-таблица «${linkName}»: будут добавлены столбцы ` +
+                `` +
                 `${leftExists ? "" : `"${leftCol} ${fromPK.type}" `}` +
                 `${rightExists ? "" : `"${rightCol} ${toPK.type}" `}`.trim() +

[Killed] StringLiteral
src/utils/validateModel.ts:387:17
               code: "LINK_FK_WILL_BE_ADDED",
               message:
                 `Линк-таблица «${linkName}»: будут добавлены столбцы ` +
-                `${leftExists ? "" : `"${leftCol} ${fromPK.type}" `}` +
+                `` +
                 `${rightExists ? "" : `"${rightCol} ${toPK.type}" `}`.trim() +
                 ` и соответствующие FOREIGN KEY.`,
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 8ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 107ms

[Survived] MethodExpression
src/utils/validateModel.ts:388:17
               message:
                 `Линк-таблица «${linkName}»: будут добавлены столбцы ` +
                 `${leftExists ? "" : `"${leftCol} ${fromPK.type}" `}` +
-                `${rightExists ? "" : `"${rightCol} ${toPK.type}" `}`.trim() +
+                `${rightExists ? "" : `"${rightCol} ${toPK.type}" `}` +
                 ` и соответствующие FOREIGN KEY.`,
               where: [explicit.id],

[Survived] MethodExpression
src/utils/validateModel.ts:395:33
           }
 
           // Композитный PK, если не отключён и ещё не задан вручную
-          const hasExplicitPK = explicit.attributes.some(a => (a as any).isPrimaryKey);
+          const hasExplicitPK = explicit.attributes.every(a => (a as any).isPrimaryKey);
           if (r.link?.compositePrimaryKey !== false && !hasExplicitPK) {
             issues.push({

[Survived] ArrowFunction
src/utils/validateModel.ts:395:58
           }
 
           // Композитный PK, если не отключён и ещё не задан вручную
-          const hasExplicitPK = explicit.attributes.some(a => (a as any).isPrimaryKey);
+          const hasExplicitPK = explicit.attributes.some(() => undefined);
           if (r.link?.compositePrimaryKey !== false && !hasExplicitPK) {
             issues.push({

[Killed] EqualityOperator
src/utils/validateModel.ts:396:15
 
           // Композитный PK, если не отключён и ещё не задан вручную
           const hasExplicitPK = explicit.attributes.some(a => (a as any).isPrimaryKey);
-          if (r.link?.compositePrimaryKey !== false && !hasExplicitPK) {
+          if (r.link?.compositePrimaryKey === false && !hasExplicitPK) {
             issues.push({
               level: "info",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 7ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 116ms

[Killed] BooleanLiteral
src/utils/validateModel.ts:396:56
 
           // Композитный PK, если не отключён и ещё не задан вручную
           const hasExplicitPK = explicit.attributes.some(a => (a as any).isPrimaryKey);
-          if (r.link?.compositePrimaryKey !== false && !hasExplicitPK) {
+          if (r.link?.compositePrimaryKey !== false && hasExplicitPK) {
             issues.push({
               level: "info",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 10ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 103ms

[Survived] ArrayDeclaration
src/utils/validateModel.ts:402:22
               code: "LINK_COMPOSITE_PK",
               message:
                 `Линк-таблица «${linkName}»: будет добавлен композитный PRIMARY KEY (${leftCol}, ${rightCol}).`,
-              where: [explicit.id],
+              where: [],
             });
           }

[Killed] BlockStatement
src/utils/validateModel.ts:410:34
     }
   }
 
-  for (const r of relationships) {
-    if (r.from !== r.to) continue;
-    const e = entById.get(r.from);
-    if (!e) continue;
-
-    const pk = getPrimaryKey(e);
-    const fkName =
-      (r.fk?.column && sanitize(r.fk.column)) ||
-      `parent_${snake(pk.name)}`;
-
-    const fkAttr = e.attributes.find(a => sanitize(a.name).toLowerCase() === fkName.toLowerCase());
-    if (fkAttr && fkAttr.type && normType(fkAttr.type) !== normType(pk.type)) {
-      issues.push({
-        level: "error",
-        code: "SELF_FK_TYPE_MISMATCH",
-        message: `Самосвязь ${e.name}↔${e.name}: тип FK «${fkName}» (${fkAttr.type}) не совпадает с типом PK «${pk.name}» (${pk.type}).`,
-        where: [e.id],
-        suggestion: `Выравняйте типы (например, смените тип «${fkName}» на ${pk.type}).`
-      });
-    }
-  }
+  for (const r of relationships) {}
 
  for (const e of entities) {
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 7ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 70ms

[Killed] EqualityOperator
src/utils/validateModel.ts:411:9
   }
 
   for (const r of relationships) {
-    if (r.from !== r.to) continue;
+    if (r.from === r.to) continue;
     const e = entById.get(r.from);
     if (!e) continue;
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 7ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 79ms

[Survived] ConditionalExpression
src/utils/validateModel.ts:411:9
   }
 
   for (const r of relationships) {
-    if (r.from !== r.to) continue;
+    if (false) continue;
     const e = entById.get(r.from);
     if (!e) continue;

[Survived] ConditionalExpression
src/utils/validateModel.ts:417:8
 
     const pk = getPrimaryKey(e);
     const fkName =
-      (r.fk?.column && sanitize(r.fk.column)) ||
+      (false) ||
       `parent_${snake(pk.name)}`;
 

[Killed] EqualityOperator
src/utils/validateModel.ts:420:43
       (r.fk?.column && sanitize(r.fk.column)) ||
       `parent_${snake(pk.name)}`;
 
-    const fkAttr = e.attributes.find(a => sanitize(a.name).toLowerCase() === fkName.toLowerCase());
+    const fkAttr = e.attributes.find(a => sanitize(a.name).toLowerCase() !== fkName.toLowerCase());
     if (fkAttr && fkAttr.type && normType(fkAttr.type) !== normType(pk.type)) {
       issues.push({
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 14ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 92ms
     ✓ негатив: повтор User/user → DUP_ENTITY_NAME 13ms

[Killed] MethodExpression
src/utils/validateModel.ts:420:78
       (r.fk?.column && sanitize(r.fk.column)) ||
       `parent_${snake(pk.name)}`;
 
-    const fkAttr = e.attributes.find(a => sanitize(a.name).toLowerCase() === fkName.toLowerCase());
+    const fkAttr = e.attributes.find(a => sanitize(a.name).toLowerCase() === fkName.toUpperCase());
     if (fkAttr && fkAttr.type && normType(fkAttr.type) !== normType(pk.type)) {
       issues.push({
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 8ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 90ms

[Killed] EqualityOperator
src/utils/validateModel.ts:421:34
       `parent_${snake(pk.name)}`;
 
     const fkAttr = e.attributes.find(a => sanitize(a.name).toLowerCase() === fkName.toLowerCase());
-    if (fkAttr && fkAttr.type && normType(fkAttr.type) !== normType(pk.type)) {
+    if (fkAttr && fkAttr.type && normType(fkAttr.type) === normType(pk.type)) {
       issues.push({
         level: "error",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 11ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 96ms

[Killed] BlockStatement
src/utils/validateModel.ts:421:79
       `parent_${snake(pk.name)}`;
 
     const fkAttr = e.attributes.find(a => sanitize(a.name).toLowerCase() === fkName.toLowerCase());
-    if (fkAttr && fkAttr.type && normType(fkAttr.type) !== normType(pk.type)) {
-      issues.push({
-        level: "error",
-        code: "SELF_FK_TYPE_MISMATCH",
-        message: `Самосвязь ${e.name}↔${e.name}: тип FK «${fkName}» (${fkAttr.type}) не совпадает с типом PK «${pk.name}» (${pk.type}).`,
-        where: [e.id],
-        suggestion: `Выравняйте типы (например, смените тип «${fkName}» на ${pk.type}).`
-      });
-    }
+    if (fkAttr && fkAttr.type && normType(fkAttr.type) !== normType(pk.type)) {}
   }
 
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 11ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 80ms

[Killed] StringLiteral
src/utils/validateModel.ts:424:15
     if (fkAttr && fkAttr.type && normType(fkAttr.type) !== normType(pk.type)) {
       issues.push({
         level: "error",
-        code: "SELF_FK_TYPE_MISMATCH",
+        code: "",
         message: `Самосвязь ${e.name}↔${e.name}: тип FK «${fkName}» (${fkAttr.type}) не совпадает с типом PK «${pk.name}» (${pk.type}).`,
         where: [e.id],
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 14ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 80ms
