[Survived] ArrayDeclaration
src/utils/validateModel.ts:426:16
         level: "error",
         code: "SELF_FK_TYPE_MISMATCH",
         message: `Самосвязь ${e.name}↔${e.name}: тип FK «${fkName}» (${fkAttr.type}) не совпадает с типом PK «${pk.name}» (${pk.type}).`,
-        where: [e.id],
+        where: [],
         suggestion: `Выравняйте типы (например, смените тип «${fkName}» на ${pk.type}).`
       });

[Killed] BlockStatement
src/utils/validateModel.ts:432:28
     }
   }
 
- for (const e of entities) {
-
-  // FIX: сущности самой пары M:N не проверяем как link-кандидаты
-  const isSide = mmPairs.some(p => p.from.id === e.id || p.to.id === e.id);
-  if (isSide) continue;
-
-  const isPartOfAnyPair = mmPairs.some(p => looksLikeLinkName(e.name, p.from.name, p.to.name));
-  if (!isPartOfAnyPair) {
-      const candidates = entities.filter(x => x.id !== e.id);
-      const hits = candidates.filter(a =>
-        snake(e.name).includes(snake(toSingular(a.name)))
-      );
-      if (hits.length >= 2) {
-        issues.push({
-          level: "warning",
-          code: "POTENTIAL_LINK_WITHOUT_REL",
-          message:
-            `Таблица «${e.name}» выглядит как линк-таблица (имя содержит корни нескольких сущностей), ` +
-            `но связи N:M для неё не найдено. Проверьте модель: это отдельная таблица или нужна связь N:M?`,
-          where: [e.id],
-        });
-      }
-    }
-  }
+ for (const e of entities) {}
 
   const ok = !issues.some(i => i.level === "error");
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 16ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 123ms

[Killed] MethodExpression
src/utils/validateModel.ts:435:18
  for (const e of entities) {
 
   // FIX: сущности самой пары M:N не проверяем как link-кандидаты
-  const isSide = mmPairs.some(p => p.from.id === e.id || p.to.id === e.id);
+  const isSide = mmPairs.every(p => p.from.id === e.id || p.to.id === e.id);
   if (isSide) continue;
 
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 8ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 119ms

[Survived] EqualityOperator
src/utils/validateModel.ts:435:36
  for (const e of entities) {
 
   // FIX: сущности самой пары M:N не проверяем как link-кандидаты
-  const isSide = mmPairs.some(p => p.from.id === e.id || p.to.id === e.id);
+  const isSide = mmPairs.some(p => p.from.id !== e.id || p.to.id === e.id);
   if (isSide) continue;
 

[Killed] ConditionalExpression
src/utils/validateModel.ts:436:7
 
   // FIX: сущности самой пары M:N не проверяем как link-кандидаты
   const isSide = mmPairs.some(p => p.from.id === e.id || p.to.id === e.id);
-  if (isSide) continue;
+  if (true) continue;
 
   const isPartOfAnyPair = mmPairs.some(p => looksLikeLinkName(e.name, p.from.name, p.to.name));
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 7ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 105ms

[Survived] ConditionalExpression
src/utils/validateModel.ts:436:7
 
   // FIX: сущности самой пары M:N не проверяем как link-кандидаты
   const isSide = mmPairs.some(p => p.from.id === e.id || p.to.id === e.id);
-  if (isSide) continue;
+  if (false) continue;
 
   const isPartOfAnyPair = mmPairs.some(p => looksLikeLinkName(e.name, p.from.name, p.to.name));

[Killed] MethodExpression
src/utils/validateModel.ts:438:27
   const isSide = mmPairs.some(p => p.from.id === e.id || p.to.id === e.id);
   if (isSide) continue;
 
-  const isPartOfAnyPair = mmPairs.some(p => looksLikeLinkName(e.name, p.from.name, p.to.name));
+  const isPartOfAnyPair = mmPairs.every(p => looksLikeLinkName(e.name, p.from.name, p.to.name));
   if (!isPartOfAnyPair) {
       const candidates = entities.filter(x => x.id !== e.id);
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 11ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 108ms

[Survived] ArrowFunction
src/utils/validateModel.ts:438:40
   const isSide = mmPairs.some(p => p.from.id === e.id || p.to.id === e.id);
   if (isSide) continue;
 
-  const isPartOfAnyPair = mmPairs.some(p => looksLikeLinkName(e.name, p.from.name, p.to.name));
+  const isPartOfAnyPair = mmPairs.some(() => undefined);
   if (!isPartOfAnyPair) {
       const candidates = entities.filter(x => x.id !== e.id);

[Killed] BooleanLiteral
src/utils/validateModel.ts:439:7
   if (isSide) continue;
 
   const isPartOfAnyPair = mmPairs.some(p => looksLikeLinkName(e.name, p.from.name, p.to.name));
-  if (!isPartOfAnyPair) {
+  if (isPartOfAnyPair) {
       const candidates = entities.filter(x => x.id !== e.id);
       const hits = candidates.filter(a =>
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh


 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 12ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 95ms

     ✓ негатив: повтор User/user → DUP_ENTITY_NAME 11ms

[Killed] BlockStatement
src/utils/validateModel.ts:439:25
   if (isSide) continue;
 
   const isPartOfAnyPair = mmPairs.some(p => looksLikeLinkName(e.name, p.from.name, p.to.name));
-  if (!isPartOfAnyPair) {
-      const candidates = entities.filter(x => x.id !== e.id);
-      const hits = candidates.filter(a =>
-        snake(e.name).includes(snake(toSingular(a.name)))
-      );
-      if (hits.length >= 2) {
-        issues.push({
-          level: "warning",
-          code: "POTENTIAL_LINK_WITHOUT_REL",
-          message:
-            `Таблица «${e.name}» выглядит как линк-таблица (имя содержит корни нескольких сущностей), ` +
-            `но связи N:M для неё не найдено. Проверьте модель: это отдельная таблица или нужна связь N:M?`,
-          where: [e.id],
-        });
-      }
-    }
+  if (!isPartOfAnyPair) {}
   }
 
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 22ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 99ms

[Killed] EqualityOperator
src/utils/validateModel.ts:440:47
 
   const isPartOfAnyPair = mmPairs.some(p => looksLikeLinkName(e.name, p.from.name, p.to.name));
   if (!isPartOfAnyPair) {
-      const candidates = entities.filter(x => x.id !== e.id);
+      const candidates = entities.filter(x => x.id === e.id);
       const hits = candidates.filter(a =>
         snake(e.name).includes(snake(toSingular(a.name)))
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 6ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 91ms

[Killed] ArrowFunction
src/utils/validateModel.ts:440:42
 
   const isPartOfAnyPair = mmPairs.some(p => looksLikeLinkName(e.name, p.from.name, p.to.name));
   if (!isPartOfAnyPair) {
-      const candidates = entities.filter(x => x.id !== e.id);
+      const candidates = entities.filter(() => undefined);
       const hits = candidates.filter(a =>
         snake(e.name).includes(snake(toSingular(a.name)))
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 8ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 92ms

[Killed] ArrowFunction
src/utils/validateModel.ts:441:38
   const isPartOfAnyPair = mmPairs.some(p => looksLikeLinkName(e.name, p.from.name, p.to.name));
   if (!isPartOfAnyPair) {
       const candidates = entities.filter(x => x.id !== e.id);
-      const hits = candidates.filter(a =>
-        snake(e.name).includes(snake(toSingular(a.name)))
+      const hits = candidates.filter(() => undefined
       );
       if (hits.length >= 2) {
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 9ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 107ms

[Survived] MethodExpression
src/utils/validateModel.ts:441:20
   const isPartOfAnyPair = mmPairs.some(p => looksLikeLinkName(e.name, p.from.name, p.to.name));
   if (!isPartOfAnyPair) {
       const candidates = entities.filter(x => x.id !== e.id);
-      const hits = candidates.filter(a =>
-        snake(e.name).includes(snake(toSingular(a.name)))
-      );
+      const hits = candidates;
       if (hits.length >= 2) {
         issues.push({

[Killed] BlockStatement
src/utils/validateModel.ts:444:29
       const hits = candidates.filter(a =>
         snake(e.name).includes(snake(toSingular(a.name)))
       );
-      if (hits.length >= 2) {
-        issues.push({
-          level: "warning",
-          code: "POTENTIAL_LINK_WITHOUT_REL",
-          message:
-            `Таблица «${e.name}» выглядит как линк-таблица (имя содержит корни нескольких сущностей), ` +
-            `но связи N:M для неё не найдено. Проверьте модель: это отдельная таблица или нужна связь N:M?`,
-          where: [e.id],
-        });
-      }
+      if (hits.length >= 2) {}
     }
   }
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 12ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 110ms

[Killed] ConditionalExpression
src/utils/validateModel.ts:444:11
       const hits = candidates.filter(a =>
         snake(e.name).includes(snake(toSingular(a.name)))
       );
-      if (hits.length >= 2) {
+      if (false) {
         issues.push({
           level: "warning",
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 9ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 1 failed) 81ms

[Killed] ConditionalExpression
src/utils/validateModel.ts:457:32
     }
   }
 
-  const ok = !issues.some(i => i.level === "error");
+  const ok = !issues.some(i => true);
   return { ok, issues };
 }
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 5ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 25 failed) 117ms

[Killed] EqualityOperator
src/utils/validateModel.ts:457:32
     }
   }
 
-  const ok = !issues.some(i => i.level === "error");
+  const ok = !issues.some(i => i.level !== "error");
   return { ok, issues };
 }
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 5ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 26 failed) 87ms

[Survived] MethodExpression
src/utils/validateModel.ts:466:10
 function fkCol(rootSingular: string, pkName: string) {
   const base = snake(pkName);
   const root = snake(rootSingular) + "_";
-  return base.startsWith(root) ? base : `${snake(rootSingular)}_${base}`;
+  return base.endsWith(root) ? base : `${snake(rootSingular)}_${base}`;
 }
 

[Killed] StringLiteral
src/utils/validateModel.ts:466:41
 function fkCol(rootSingular: string, pkName: string) {
   const base = snake(pkName);
   const root = snake(rootSingular) + "_";
-  return base.startsWith(root) ? base : `${snake(rootSingular)}_${base}`;
+  return base.startsWith(root) ? base : ``;
 }
 
killedBy: All tests
statusReason: RUN  v4.0.14 D:/React/smarted/frontend/.stryker-tmp/sandbox-tiCeRh



 ✓ src/utils/tests/validateModel.mockHelpers.test.ts (1 test) 5ms

 ❯ src/utils/tests/validateModel.test.ts (39 tests | 2 failed) 48ms
